// Создал файл, для сохранения наработок. Поскольку сохранение напрямую из консоли кода выполняется длительное время из-за 
// большого количество строк во временных таблицах значений

КоличествоИтераций = 40000;
н = 0;
Для Каждого СтрокаТЧ Из ДанныеКвитанций Цикл
	н = н + 1;
	Дадата = СтрокаТЧ.Дадата;
	Если НЕ Дадата = Неопределено Тогда
		Если ТипЗнч(Дадата) = Тип("Структура") Тогда
			ОтветСервиса = Неопределено;
			Если Дадата.Свойство("suggestions", ОтветСервиса) Тогда
				
				Если ТипЗнч(ОтветСервиса) = Тип("Массив") Тогда
					
					  п = ОтветСервиса[0];
					  ФИАСДома = п.data.house_fias_id;
					  Если ТипЗнч(ФИАСДома) = Тип("Строка") и СтрДлина(ФИАСДома) = 36 Тогда
						  // Все хорощо. Осталось только найти нужный дом и квартиру среди списка
					  КонецЕсли;
					  
				  КонецЕсли;
			ИначеЕсли Дадата.Свойство("family", ОтветСервиса) Тогда
				  
				  // Ошибка. Строка не обработана. Возможно закончился лимит или сервис для учетной записи недоступен
				  
				  прервать;
				  
				
			КонецЕсли;
			
		КонецЕсли;
		
	Иначе
		// Строка еще не обработана
		//Прервать;
	КонецЕсли;
	
	Если Н > КоличествоИтераций Тогда Прервать КонецЕсли;
КонецЦикла;
