ТЗ = в1;
Если ТЗ.Колонки.Найти("КодФиасДома")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("КодФиасДома");
КонецЕсли;
Если ТЗ.Колонки.Найти("НомерДомаДадата")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("НомерДомаДадата");
КонецЕсли;
Если ТЗ.Колонки.Найти("НомерДома")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("НомерДома");
КонецЕсли;


Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ТЗ.Количество(), "Обработка");

Для каждого СтрокаТЗ Из ТЗ Цикл
	ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
	Подсказки = СтрокаТЗ.Дадата.suggestions;
	ПозицияНомерДома = СтрНайти(СтрокаТЗ.Адрес, " д. ");
	НомерДома = Сред(СтрокаТЗ.Адрес, ПозицияНомерДома + 4);
	ПозицияПомещения = СтрНайти(НомерДома, ",");
	Если ПозицияПомещения > 0 Тогда
		НомерДома = Сред(НомерДома, 1, ПозицияПомещения-1);
	КонецЕсли;
	СтрокаТЗ.НомерДома = НомерДома;
	Если Подсказки.Количество() = 1 Тогда
		Подсказка = Подсказки[0];
		СтрокаТЗ.КодФиасДома = Подсказка.data.house_fias_id;
		СтрокаТЗ.НомерДомаДадата = Подсказка.data.house;
	Иначе
		Для каждого Подсказка Из Подсказки Цикл
			Если Подсказка.data.house = НомерДома Тогда
				СтрокаТЗ.КодФиасДома = Подсказка.data.house_fias_id;
				СтрокаТЗ.НомерДомаДадата = Подсказка.data.house;
				Прервать;
			КонецЕсли;
			
		КонецЦикла;

	КонецЕсли
КонецЦикла;
ирОбщий.ОсвободитьИндикаторПроцессаЛкс();
