// это код из алгоритма консоли кода. Для запуска требуется наличие модуля 

Если ТЗ.Колонки.Найти("КодФиасДома")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("КодФиасДома");
КонецЕсли;
Если ТЗ.Колонки.Найти("НомерДомаДадата")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("НомерДомаДадата");
КонецЕсли;
Если ТЗ.Колонки.Найти("НомерДома")  = Неопределено Тогда
	ТЗ.Колонки.Добавить("НомерДома");
КонецЕсли;


Индикатор = ирОбщий.ПолучитьИндикаторПроцессаЛкс(ТЗ.Количество(), "Обработка");

Для каждого СтрокаТЗ Из ТЗ Цикл
	ирОбщий.ОбработатьИндикаторЛкс(Индикатор);
	//Если ЗначениеЗаполнено(СтрокаТЗ.КодФиасДома) Тогда Продолжить; КонецЕсли;
	Если ЗначениеЗаполнено(СтрокаТЗ.Дадата) и ТипЗнч(СтрокаТЗ.Дадата) = Тип("Структура") Тогда
		Если СтрокаТЗ.Дадата.Свойство("suggestions") Тогда
			Подсказки = СтрокаТЗ.Дадата.suggestions;
			СтрокаАдреса = СтрокаТЗ.Адрес;
			Если СтрНайти(СтрокаАдреса, " Домовладение ") Тогда
				ПозицияНомерДома = СтрНайти(СтрокаАдреса, " Домовладение ");
				НомерДома = Сред(СтрокаАдреса, ПозицияНомерДома + 14);
			ИначеЕсли СтрНайти(СтрокаАдреса, " Владение ") Тогда
				ПозицияНомерДома = СтрНайти(СтрокаАдреса, " Владение ");
				НомерДома = Сред(СтрокаАдреса, ПозицияНомерДома + 10);
			ИначеЕсли СтрНайти(СтрокаАдреса, " Дом ") Тогда
				ПозицияНомерДома = СтрНайти(СтрокаАдреса, " Дом ");
				НомерДома = Сред(СтрокаАдреса, ПозицияНомерДома + 5);
			ИначеЕсли СтрНайти(СтрокаАдреса, " д. ") Тогда
				ПозицияНомерДома = СтрНайти(СтрокаАдреса, " д. ");
				НомерДома = Сред(СтрокаАдреса, ПозицияНомерДома + 4);
			КонецЕсли;
			ПозицияКорп = СтрНайти(НомерДома, "корп");
			Если ПозицияКорп > 0 Тогда
				НомерДома = Сред(НомерДома, 1, ПозицияКорп-1);
			КонецЕсли;
			ПозицияПомещения = СтрНайти(НомерДома, ",");
			Если ПозицияПомещения > 0 Тогда
				НомерДома = Сред(НомерДома, 1, ПозицияПомещения-1);
			КонецЕсли;
			СтрокаТЗ.НомерДома = НомерДома;
			Если Подсказки.Количество() = 1 Тогда
				Подсказка = Подсказки[0];
				СтрокаТЗ.КодФиасДома = Подсказка.data.house_fias_id;
				СтрокаТЗ.НомерДомаДадата = Подсказка.data.house;
			Иначе
				Для каждого Подсказка Из Подсказки Цикл
					Если Подсказка.data.house = НомерДома Тогда
						СтрокаТЗ.КодФиасДома = Подсказка.data.house_fias_id;
						СтрокаТЗ.НомерДомаДадата = Подсказка.data.house;
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецЦикла;
ирОбщий.ОсвободитьИндикаторПроцессаЛкс();
